---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SsePointBasetypeEnum
source: html/8138a2d4-3a07-6a7c-78ed-2eab94e4947f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SsePointBasetypeEnum Property

"Point Base Type"

## Syntax (C#)
```csharp
public static ForgeTypeId SsePointBasetypeEnum { get; }
```